-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Sep 10, 2024 at 09:22 AM
-- Server version: 10.4.24-MariaDB
-- PHP Version: 7.4.29

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `comsci`
--

CREATE DATABASE comsci;
USE comsci;

-- --------------------------------------------------------

--
-- Table structure for table `students`
--

CREATE TABLE `students` (
  `id` varchar(11) NOT NULL,
  `name` varchar(30) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `students`
--

INSERT INTO `students` (`id`, `name`) VALUES
('66122420101', 'นายกิตติชัย สมบัติวงค์'),
('66122420102', 'นายกิตติชัย สีเเก้ว'),
('66122420103', 'นายจิรสิน แซอึ้ง'),
('66122420104', 'นายชวาลวุฒิ ดีเอี่ยม'),
('66122420105', 'นายณัฐชนน ชินวงค์'),
('66122420106', 'นายณัฐวุฒิ จันครา'),
('66122420107', 'นายณัฐสิทธิ์ บุตรมาศ'),
('66122420109', 'นายธนวัฒน์ อินทรจินดา'),
('66122420110', 'นายธวัชชัย รัฐมั่น'),
('66122420111', 'นายธีรภัทร สิมมาวัน'),
('66122420112', 'นายนพรัตน์ เจริญลอย'),
('66122420113', 'นายนวพงษ์ ธรรมสัตย์'),
('66122420114', 'นายปิยวัฒน์ เข็มคุณ'),
('66122420115', 'นายเมธี สังขฤกษ์'),
('66122420116', 'นายวชรพล ทองบุราณ'),
('66122420117', 'นายสุริยา ขันทา'),
('66122420119', 'นายอัมรินทร์ จำปาหอม'),
('66122420120', 'นายอาทิตย์ สายกนก'),
('66122420121', 'นางสาวณัฐธิชา ทองทวน'),
('66122420122', 'นางสาวณัฐวดี คมกฤษ'),
('66122420125', 'นางสาวสุรัชดาพร ชูกร'),
('66122420126', 'นายDAYUTH THY'),
('66122420129', 'นายPHYLONG TOUN'),
('66122420131', 'นายSETHAVATHANAK SAO'),
('66122420132', 'นายVIKSOTHUN SARIK'),
('66122420201', 'นายกฤษดา ใจบุญ'),
('66122420202', 'นายกันตพงศ์ เกษกุล'),
('66122420204', 'นายชัยสมนึก บรรดิษฐ์'),
('66122420205', 'นายฐิติภัทร จงรักษ์'),
('66122420206', 'นายฐิราชัย พลหาญ'),
('66122420207', 'นายณัฐพงษ์ กิ่งมาลา'),
('66122420208', 'นายณัฐวุฒิ สืบบุตร'),
('66122420210', 'นายทศพล นามพรม'),
('66122420211', 'นายทัตเทพ ช่วยตา'),
('66122420215', 'นายพีรพัฒน์ ยุทธตระกูล'),
('66122420217', 'นายวีรพงษ์ โสระธิ'),
('66122420218', 'นายศิวกร เห็มสุข'),
('66122420220', 'นายอนันต์ ทอนไสระ'),
('66122420221', 'นายอภิธารณ์ ชลกาญจน์'),
('66122420225', 'นางสาวเกศรินทร์ ดาวพันธ์'),
('66122420227', 'นางสาวเณศรา เงินมั่น'),
('66122420228', 'นางสาวรุ่งทิวา สุวรรณพรม'),
('66122420229', 'นางสาวสุทธิดา วงค์ใหญ่'),
('66122420302', 'นายขวัญประชา จันทรจิตร'),
('66122420303', 'นายโชคอนันต์ ผลศักดิ์'),
('66122420315', 'นายภรภัทร บุญจันทร์'),
('66122420318', 'นายวราเทพ บุญจริง');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `students`
--
ALTER TABLE `students`
  ADD PRIMARY KEY (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
